<template>
  <div class="container-id">
    <div>
      <p class="subtitle-id">
        Wizard определил Ваш институт:
      </p>

      <p class="title-id">
        {{ direction }}
      </p>
    </div>
  </div>
</template>

<script>
const DIRECTIONS = {
  2470: 'Механико-машиностроительный институт',
  2951: 'Институт материаловедения и металлургии',
  2957: 'Строительный институт',
  2959: 'Химико-технологический институт',
  2961: 'Институт физической культуры, спорта и молодежной политики',
  2973: 'Бизнес-школа',
  20422: 'Институт радиоэлектроники и информационных технологий–РтФ',
  40378: 'Факультет ускоренного обучения',
  40773: 'Институт технологий открытого образования',
  106511: 'Институт дополнительного образования и профессиональной переподготовки',
  203338: 'Институт образовательных информационных технологий',
  623655: 'Институт военно-технического образования и безопасности',
  1034731: 'Общеуниверситетские кафедры',
  2139043: 'Высшая школа экономики и менеджмента',
  2139044: 'Институт государственного управления и предпринимательства',
  2139051: 'Институт математики и компьютерных наук',
  2139211: 'Институт фундаментального образования',
  2161061: 'Факультет военного обучения',
  2161062: 'Физико-технологический институт',
  2161063: 'Факультет повышения квалификации преподавателей и профессиональной переподготовки',
  2173844: 'Институт социальных и политических наук',
  2174103: 'Высшая инженерная школа',
  2218244: 'Институт гуманитарных наук и искусств',
  2223186: 'Институт новых материалов и технологий',
  2231267: 'Институт естественных наук и математики',
  2231268: 'Институт естественных наук',
  2231275: 'Уральский энергетический институт',
  2231276: 'Институт международного образования',
  2231283: 'Центр дополнительного профессионального образования',
  2231284: 'Военный учебный центр',
  2231285: 'Центр повышения квалификации преподавателей и профессиональной переподготовки',
  2231790: 'Уральский гуманитарный институт',
  2266965: 'Институт строительства и архитектуры',
  2266966: 'Институт экономики и управления'
}

export default {
  async asyncData ({ params, $axios, route }) {
    const { groups } = route.query
    const direction = await $axios.$get(`http://127.0.0.1:3000/api/v1/direction?groups=${groups}`)
    return { direction: DIRECTIONS[direction] }
  }
}
</script>

<style>
.container-id {
  margin: 0 auto;
  min-height: 100vh;
  display: flex;
  justify-content: center;
  align-items: center;
  text-align-last: left;
  max-width: 1024px;
}

.title-id {
  font-family: "Quicksand", "Source Sans Pro", -apple-system, BlinkMacSystemFont,
    "Segoe UI", Roboto, "Helvetica Neue", Arial, sans-serif;
  display: block;
  font-weight: 300;
  font-size: 80px;
  color: #35495e;
  letter-spacing: 1px;
}

.subtitle-id {
  font-weight: 300;
  font-size: 42px;
  color: #526488;
  word-spacing: 5px;
  padding-bottom: 15px;
  max-width: 800px;
}
</style>
