direction_dict = {
    "09.03.01 Информатика и вычислительная техника": "60afa63bd4b73810c6668b9f",
    "09.03.03 Прикладная информатика": "60afa646d4b73810c6668ba0",
    "09.03.04 Программная инженерия": "60afa650d4b73810c6668ba1",
    "20.05.01 Пожарная безопасность": "60b0a66a4f6d7d09157cf996",
    "20.03.01 Техносферная безопасность": "60b0a6774f6d7d09157cf997",
    "13.00.00 Электронэнергетика и теплоэнергетика": "60d6e15649a79615584e52ae",
    "08.03.01 Строительство": "60d7250f768401166e218a51",
    "06.03.01 Биология": "60d726ff768401166e218a53",
    "03.03.02 Физика": "60d8b4712aa76e1efc813b1a",
    "10.00.00 Информационная безопасность": "60d8c6092aa76e1efc813b1b",
    "11.00.00 Электроника, радиотехника и системы связи": "60d9aa81ba6979027e1d02ac",
    "23.03.02 Проектирование автомобилей и подъемно-транспортных машин": "60dc6d615a40bd06df70840c",
    "04.03.01 Химия": "60e2f862900b8503ee4fbec2",
    "22.03.01 Материаловедение и технологии металлических материалов": "60e31f43900b8503ee4fbec3",
    "49.03.01 Физическая культура": "60e336f9900b8503ee4fbec4",
    "39.03.03 Организация работы с молодежью": "60e34832900b8503ee4fbec5"
}

direction_list = sorted(direction_dict.keys())